====================================
Test column identifiers
====================================

select
    1 as value,
    2 as column_2

---

[
    {value: 1, column_2: 2},
]


====================================
Test inline comments
====================================

-- here is a comment
select 1 as id

---

[
    {id: 1}
]


====================================
Test multi-line comments
====================================

/*
    this is a comment
*/
select 1 as id

---

[
    {id: 1}
]


====================================
Test semicolons ending statements
====================================

select 1 as id;

---

[
    {id: 1}
]


====================================
Test distinct select
====================================

with data as (
    select 2 as id
    union
    select 2 as id

)

select distinct id
from data


---

[
    {id: 2}
]

====================================
Test select order
====================================

with data as (
    select 3 as id
    union
    select 1 as id
    union
    select 2 as id

)

select id
from data
order by id


---

[
    {id: 1},
    {id: 2},
    {id: 3}
]

====================================
Test select order desc
====================================

with data as (
    select 3 as id
    union
    select 1 as id
    union
    select 2 as id

)

select id
from data
order by id desc


---

[
    {id: 3},
    {id: 2},
    {id: 1}
]
