====================================
Test column identifiers
====================================

select
    1 as value,
    2 as column_2

---

[
    {value: 1, column_2: 2},
]


====================================
Test inline comments
====================================

-- here is a comment
select 1 as id

---

[
    {id: 1}
]


====================================
Test multi-line comments
====================================

/*
    this is a comment
*/
select 1 as id

---

[
    {id: 1}
]


====================================
Test semicolons ending statements
====================================

select 1 as id;

---

[
    {id: 1}
]


====================================
Test distinct select
====================================

with data as (
    select 2 as id
    union
    select 2 as id
    union
    select 3 as id

)

select distinct id
from data
order by 1


---

[
    {id: 2},
    {id: 3}
]

====================================
Test case when
====================================

select
    i,
    case when i < 2 then 'a' else 'b' end as value
from generate_series(4)
order by i


---

[
    {i: 0, value: 'a'},
    {i: 1, value: 'a'},
    {i: 2, value: 'b'},
    {i: 3, value: 'b'},
]
